app/controllers/chats_controller.rb

SELECT "chats".* FROM "chats"
---
  def index
    @chats = Chat.all

SELECT  "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @chat = Chat.find(params[:id])

INSERT INTO "chats" ("comment", "game_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["comment", "Hello"], ["game_id", 1], ["created_at", "2016-02-20 23:44:20.271933"], ["updated_at", "2016-02-20 23:44:20.271933"]]
---
  def create
    @chat = Chat.new(chat_params)
    respond_to do |format|
      if @chat.save

DELETE FROM "chats" WHERE "chats"."id" = ?  [["id", 2]]
---
  def destroy
    @chat.destroy

SELECT  "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT 1  [["id", 2]]
---
  def set_chat
    @chat = Chat.find(params[:id])