app/controllers/games_controller.rb

  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("sport", "location", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["sport", "Basketball"], ["location", ""], ["time", ""], ["created_at", "2016-02-20 22:39:09.239950"], ["updated_at", "2016-02-20 22:39:09.239950"]]

  def destroy
    @game.destroy
---
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 1]]