app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @users = User.find(params[:id])

INSERT INTO "users" ("name", "email", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Juan"], ["email", "jmopr83@gmail.com"], ["location", "Miami"], ["created_at", "2016-02-20 23:47:16.420505"], ["updated_at", "2016-02-20 23:47:16.420505"]]
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Jose"], ["password_digest", "$2a$10$.HcwrbCvbWuJJ.kkbmudOuW7KJzh7IhXvClf7aavbS1TkH54yB.ZK"], ["updated_at", "2016-02-22 01:03:01.286586"], ["id", 101]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)